{"keys":[{"path":["title"],"id":"title","weight":1,"src":"title"},{"path":["body"],"id":"body","weight":1,"src":"body"}],"records":[{"i":0,"$":{"0":{"v":"This page has not yet sprouted","n":0.408},"1":{"v":"[Dendron](https://dendron.so/) (the tool used to generate this site) lets authors selective publish content. You will see this page whenever you click on a link to an unpublished page\n\n![](https://foundation-prod-assetspublic53c57cce-8cpvgjldwysl.s3-us-west-2.amazonaws.com/assets/images/not-sprouted.png)","n":0.189}}},{"i":1,"$":{"0":{"v":"Root","n":1},"1":{"v":"# Group Wiki\n\nHi everyone! I wanted to share this prototype group wiki with everyone. This is one way that we might create a centralized repository documenting our work.\n\n* [[EMOD usage|emod]]\n* Epidemiology\n  * [[HIV|hiv]]\n  * Malaria\n\n> This website is generated by a Dendron template. For more information, see the [template README file](https://github.com/dendronhq/template.publish.github-action/). Feel free to modify and delete this section.","n":0.13}}},{"i":2,"$":{"0":{"v":"Hiv","n":1},"1":{"v":"\n# HIV\n","n":0.707}}},{"i":3,"$":{"0":{"v":"Emod","n":1},"1":{"v":"\n# EMOD\n\nHere we could store best practices for building, calibrating, and executing EMOD simulations.\n\n## EMOD Usage\n\n### Designing Simulations\n\n### Calibration\n\n### Execution\n\n## EMOD Setup Tutorial\n\n[[EMOD Tutorial|emod.tutorial]]","n":0.204}}},{"i":4,"$":{"0":{"v":"Tutorial","n":1},"1":{"v":"\n# Getting Started with EMOD\n\n## Introduction\n\nWelcome to EMOD!\n\nThis repository and the documents contained herein are intended to serve as a basic walkthrough of how to install and run EMOD.\n\nWe will walk through the steps required to use EMOD and DTK-Tools as a black box software model. The full scope of how to build and customize an EMOD model from scratch will not be covered here.  The next recommended steps for understanding the different features and nuances of the epidemiological model are covered elsewhere.\n\n[EMOD Software Overview](https://docs.idmod.org/projects/emod-hiv/en/latest/software-overview.html)\n\n## A guide to the files in this directory\n\nThe present directory contains the following files and directories:\n\n* `simtools.ini`\n* `Data/calibration_ingest_form_Malawi_3_node_AB2_no_inc.xlsm` - This is the \"ingest file.\" It contains a great deal of information which the simulation uses as inputs. This includes:\n  * the list of dynamic parameters which will be fit during the calibration stage,\n  * the list of calibration target variables and how the calibration stage should weight them\n  * all calibration target data (ie, empirical data used to calibrate the model)\n* `InputFiles`\n  * `Static/Demographics_Malawi.json` - Malawi demographics file; includes all mortality and fertility data\n* `InputFiles/Templates`\n  * `PFA_Overlay_Malawi.json` - Malawi demographics file which adjusts the pair formation algorithm according to likelihood of pair formation between different demographic groups\n  * `Risk_Assortivity_Overlay_Malawi.json` - Malawi demographics file which adjusts assortativity between agents according to risk group (ie, risk-prone agents may be more likely to form pairs with other risk-prone agents)\n  * `Accessibility_and_Risk_IP_Overlay_Malawi.json` - Malawi demographics file which adjusts accessibility and risk\n  * `campaign_Malawi_1Dec2021_recalib.json` - \"Campaign file,\" which defines the full structure of the network of events which occur in the simulation. Together, this network of events describes the events which lead to transmission; the course of infection within infected individuals; and all the different ways individual agents interact with the health care system --- testing, treatment, care, etc.\n  * `config.json` - a (mostly) alphabetical list of all parameters which are defined in the simulation. Not all of these parameters are necessary to build a simulation of HIV, but \n* `optim_script.py` \n  * Script for configuring the calibration stage of the simulation\n* `run_scenarios.py`\n  * Script for configuring and executing the simulation runs\n* `scenarios.csv`\n  * List of scenarios, which are run as part of `run_scenarios`\n\nAll together, these files can be used to build and run a simulation of HIV transmission in Malawi using EMOD and DTK-Tools.\n\nIt is recommended that you clone this repo in your personal folder in the Bershteyn lab group directory:\n\n`/gpfs/data/bershteynlab/EMOD/[YOUR FOLDER]`\n\n## Steps for Installing EMOD and DTK-Tools\n\nFollow these steps to install EMOD and DTK-Tools on BigPurple (NYU Langone's cluster):\n\n### Configure bash and python environment\n\n1. `ssh` into BigPurple\n2. Create a virtual python environment for the purpose of holding all the python packages that DTK-Tools depends on. Run the following in the command line:\n\n```\npython -m venv ~/environments/dtk-tools-p36\nsource ~/environments/dtk-tools-p36/bin/activate\n```\n\n3. Modify the bash environment to automatically launch the python environment just created. Paste the following into the `.bashrc` file:\n\n```\n# .bashrc\n\n# Source global definitions\nif [ -f /etc/bashrc ]; then\n        . /etc/bashrc\nfi\n\n# User specific aliases and functions\n\nmodule load singularity/3.1\nmodule load python/cpu/3.6.5\nmodule load git/2.17.0\n\nsource ~/environments/dtk-tools-p36/bin/activate\nexport PYTHONPATH=~/environments/dtk-tools-p36/lib/python3.6/site-packages\n```\n\nRun in command line: `source ~/.bashrc`\n\n### Install DTK-Tools and Disease-Specific Packages\n\nUse git to install DTK-Tools and packages specific to HIV. It is recommended that you install these in the `home` directory on BigPurple: `gpfs/home/[YOUR NAME]\n\n1. Make sure that you have access to the Institute for Disease Modeling's github repos. Both dtk-tools and HIV-Analyzers are private, so your github account must be given permission to view and clone \n2. Set up a public key on BigPurple and add the key to github. This will allow you to clone and directly download EMOD and DTK-Tools from github onto BigPurple.\n    * [Generate a new ssh key](https://docs.github.com/en/authentication/connecting-to-github-with-ssh/generating-a-new-ssh-key-and-adding-it-to-the-ssh-agent)\n    * [Add your key to your github account](https://docs.github.com/en/authentication/connecting-to-github-with-ssh/adding-a-new-ssh-key-to-your-github-account)\n3. Clone the DTK-Tools repo.\nIn your `home` directory on BigPurple, run the following in the command line:\n    ```\n    cd ~\n    git clone git@github.com:InstituteforDiseaseModeling/dtk-tools.git dtk-tools-p36\n    cd dtk-tools-p36\n    python setup_manual.py\n    ```\nIn the command line run `dtk -h` to confirm installation.\n\n4. Clone the HIV-analyzers repo\nIn your `home` directory on BigPurple, run the following in the command line:\n\n    ```\n    cd ~\n    git clone git clone git@github.com:InstituteforDiseaseModeling/HIV-Analyzers.git\n    cd HIV-Analyzers\n    python setup.py develop\n    ```\n\n5. Install Docker image to run simulations.\nThe Docker image creates a virtual environment where all of the packages and extensions required to run EMOD smoothly already exist. This saves the trouble of needing to re-install and re-configure them. Run the following in the command line:\n\n    ```\n    cd ~\n    mkdir images\n    cd images\n    singularity pull docker://idm-docker-public.packages.idmod.org/nyu/dtk:20200306\n    ```\n\n## Guide to Simulation Setup\n\nThe `simtools.ini` file defines the paths where the simulation looks for inputs and writes outputs.\n\nIt is recommended practice to store simulation outputs in the `scratch` directory on BigPurple. This is a private directory which can be used for temporary storage. In `simtools.ini`, set the simulation root path to this location:\n\n    ```\n    # Path where the experiment/simulation outputs will be stored\n    sim_root = /gpfs/scratch/[YOUR NAME]/experiments`\n    ```\n\nSet the `input_root` as the path to the current directory\n\n    ```\n    input_root = /gpfs/data/bershteynlab/EMOD/[YOUR FOLDER]/malawi2022_tutorial/InputFiles/Static\n    ```\n\n## How to calibrate\n\nThe first stage of the simulation will be to calibrate the model. This process will determine a probability distribution for each of the model parameters designated as \"dynamic\" which will then be used to run the simulation and produce output.\n\n1. Open a virtual environment with `screen`\n2. Request a compute node on BigPurple: \n    * `srun -p cpu_short -n 2 --mem-per-cpu=8G --time=11:00:00 --pty bash` \n    * More documentation on how to configure the different parts of this command [here](https://hpcmed.org/guide/slurm)\n3. Run in command line: `python optim_script.py`\n\nAfter the simulation runs, a number of new files will appear:\n* A directory called `Malawi--0.001--rep3--test0`\n  * Contains all of the outputs of each of 10 iterations performed by the simulation (`iter0`, `iter1`, etc)\n  * Inside each `iter` folder is a set of PDF outputs which record the log-likelihood distribution of each dynamic parameter, and shows how the maximum likelihood parameter value evolves over the course of each iteration during calibration.\n* Can be ignored:\n  * `post_channel_config.json` \n    * This defines how the simulation population is subdivided demographically in order to match each demographic subgroup to its corresponding calibration target. A schema for the simulation output.\n  * `output`\n    * A directory which contains a number of `HIVCalibSite` .csv files.\n\n## How to run a scenario\n\nThe second stage of the simulation will be to run an ensemble of simulations. The simulation will draw from the calibrated parameter values from the previous stage and produce model output which may then be analyzed and interpreted.\n\nRun the following python command inside the compute node on BigPurple:\n\n    ```\n    python run_scenarios.py -c optim_script.py --resample-method roulette --nsamples 25 --output-dir MWI_baseline --suite-name MWI_baseline --table scenarios.csv --calib-dir Malawi--0.001--rep3--test0\n    ```\n\n* `-c` and `--calib-dir` : The command references the script used to perform the calibration (`optim_script.py` and the directory where the calibration results were stored.) \n* `--resample-method` and `--nsamples` : The command allows the user to define how the parameter values will be resampled, and the number of times to resample each parameter\n* `--table` : The user provides a table of scenarios to run. In this case, only the baseline will run.\n* --output-dir`: Where simulation outputs will go\n\nAfter the simulation runs, a number of new files and directories will appear. The output directory will contain a set of reports. These reports will also appear in the `sim_root` directory defined in `simtools.ini`\n","n":0.029}}}]}
